      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.



       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY SPACE ERASE EOS
            DISPLAY "Hello world" AT 1020.
            STOP " ".
       END PROGRAM YOUR-PROGRAM-NAME.
