       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMNAME.
      *=================================================================
      * Purpose:
      * Author:  Victor Domingos
      * Date:    
      * License: MIT
      *=================================================================
       ENVIRONMENT DIVISION.
      *-----------------------------------------------------------------
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
      *-----------------------------------------------------------------
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      *=================================================================
       DATA DIVISION.

      *-----------------------------------------------------------------
       FILE SECTION.

      *-----------------------------------------------------------------
       WORKING-STORAGE SECTION.


      *=================================================================
       PROCEDURE DIVISION.

       MAIN-PROCEDURE.

           STOP RUN.

       END PROGRAM PROGRAMNAME.
